app/controllers/campaigns_controller.rb

  def index
    @campaigns = Campaign.all
---
SELECT "campaigns".* FROM "campaigns"

  def show
    @campaign = Campaign.find(params[:id])
---
SELECT  "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = $1 LIMIT 1  [["id", 1]]