app/controllers/static_pages_controller.rb

  def home
    @recent_campaigns = Campaign.last(3)
---
SELECT  "campaigns".* FROM "campaigns"  ORDER BY "campaigns"."id" DESC LIMIT 3